# Задайте последовательность чисел. Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности
   
start_str = [7, 8, 3, 8, 5, 1, 5, 8, 8, 9]
mod = set(start_str)
start_str_mod = list(mod)

print(start_str)
print(start_str_mod)